kabel42/ch32v003/ch32v003_mmr.c
#include "ch32v003_mmr.h"

volatile pwr_ctlr_t PWR_CTLR __attribute__((section(".pwr_ctlr")));
volatile pwr_csr_t PWR_CSR __attribute__((section(".pwr_csr")));
volatile pwr_awucsr_t PWR_AWUCSR __attribute__((section(".pwr_awucsr")));
volatile pwr_awuapr_t PWR_AWUAPR __attribute__((section(".pwr_awuapr")));
volatile pwr_awupsc_t PWR_AWUPSC __attribute__((section(".pwr_awupsc")));
volatile rcc_ctlr_t RCC_CTLR __attribute__((section(".rcc_ctlr")));
volatile rcc_cfgr0_t RCC_CFGR0 __attribute__((section(".rcc_cfgr0")));
volatile rcc_intr_t RCC_INTR __attribute__((section(".rcc_intr")));
volatile rcc_apb2prstr_t RCC_APB2PRSTR __attribute__((section(".rcc_apb2prstr")));
volatile rcc_apb1prstr_t RCC_APB1PRSTR __attribute__((section(".rcc_apb1prstr")));
volatile rcc_ahbpcenr_t RCC_AHBPCENR __attribute__((section(".rcc_ahbpcenr")));
volatile rcc_apb2pcenr_t RCC_APB2PCENR __attribute__((section(".rcc_apb2pcenr")));
volatile rcc_apb1pcenr_t RCC_APB1PCENR __attribute__((section(".rcc_apb1pcenr")));
volatile rcc_rstsckr_t RCC_RSTSCKR __attribute__((section(".rcc_rstsckr")));
volatile extend_extend_ctr_t EXTEND_EXTEND_CTR __attribute__((section(".extend_extend_ctr")));
volatile uint32_t EXTEND_EXTEND_KR __attribute__((section(".extend_extend_kr")));
volatile gpioa_cfglr_t GPIOA_CFGLR __attribute__((section(".gpioa_cfglr")));
volatile gpioa_indr_t GPIOA_INDR __attribute__((section(".gpioa_indr")));
volatile gpioa_outdr_t GPIOA_OUTDR __attribute__((section(".gpioa_outdr")));
volatile gpioa_bshr_t GPIOA_BSHR __attribute__((section(".gpioa_bshr")));
volatile gpioa_bcr_t GPIOA_BCR __attribute__((section(".gpioa_bcr")));
volatile gpioa_lckr_t GPIOA_LCKR __attribute__((section(".gpioa_lckr")));
volatile gpioc_cfglr_t GPIOC_CFGLR __attribute__((section(".gpioc_cfglr")));
volatile gpioc_indr_t GPIOC_INDR __attribute__((section(".gpioc_indr")));
volatile gpioc_outdr_t GPIOC_OUTDR __attribute__((section(".gpioc_outdr")));
volatile gpioc_bshr_t GPIOC_BSHR __attribute__((section(".gpioc_bshr")));
volatile gpioc_bcr_t GPIOC_BCR __attribute__((section(".gpioc_bcr")));
volatile gpioc_lckr_t GPIOC_LCKR __attribute__((section(".gpioc_lckr")));
volatile gpiod_cfglr_t GPIOD_CFGLR __attribute__((section(".gpiod_cfglr")));
volatile gpiod_indr_t GPIOD_INDR __attribute__((section(".gpiod_indr")));
volatile gpiod_outdr_t GPIOD_OUTDR __attribute__((section(".gpiod_outdr")));
volatile gpiod_bshr_t GPIOD_BSHR __attribute__((section(".gpiod_bshr")));
volatile gpiod_bcr_t GPIOD_BCR __attribute__((section(".gpiod_bcr")));
volatile gpiod_lckr_t GPIOD_LCKR __attribute__((section(".gpiod_lckr")));
volatile afio_pcfr_t AFIO_PCFR __attribute__((section(".afio_pcfr")));
volatile afio_exticr_t AFIO_EXTICR __attribute__((section(".afio_exticr")));
volatile exti_intenr_t EXTI_INTENR __attribute__((section(".exti_intenr")));
volatile exti_evenr_t EXTI_EVENR __attribute__((section(".exti_evenr")));
volatile exti_rtenr_t EXTI_RTENR __attribute__((section(".exti_rtenr")));
volatile exti_ftenr_t EXTI_FTENR __attribute__((section(".exti_ftenr")));
volatile exti_swievr_t EXTI_SWIEVR __attribute__((section(".exti_swievr")));
volatile exti_intfr_t EXTI_INTFR __attribute__((section(".exti_intfr")));
volatile dma1_intfr_t DMA1_INTFR __attribute__((section(".dma1_intfr")));
volatile dma1_intfcr_t DMA1_INTFCR __attribute__((section(".dma1_intfcr")));
volatile dma1_cfgr1_t DMA1_CFGR1 __attribute__((section(".dma1_cfgr1")));
volatile dma1_cntr1_t DMA1_CNTR1 __attribute__((section(".dma1_cntr1")));
volatile uint32_t DMA1_PADDR1 __attribute__((section(".dma1_paddr1")));
volatile uint32_t DMA1_MADDR1 __attribute__((section(".dma1_maddr1")));
volatile dma1_cfgr2_t DMA1_CFGR2 __attribute__((section(".dma1_cfgr2")));
volatile dma1_cntr2_t DMA1_CNTR2 __attribute__((section(".dma1_cntr2")));
volatile uint32_t DMA1_PADDR2 __attribute__((section(".dma1_paddr2")));
volatile uint32_t DMA1_MADDR2 __attribute__((section(".dma1_maddr2")));
volatile dma1_cfgr3_t DMA1_CFGR3 __attribute__((section(".dma1_cfgr3")));
volatile dma1_cntr3_t DMA1_CNTR3 __attribute__((section(".dma1_cntr3")));
volatile uint32_t DMA1_PADDR3 __attribute__((section(".dma1_paddr3")));
volatile uint32_t DMA1_MADDR3 __attribute__((section(".dma1_maddr3")));
volatile dma1_cfgr4_t DMA1_CFGR4 __attribute__((section(".dma1_cfgr4")));
volatile dma1_cntr4_t DMA1_CNTR4 __attribute__((section(".dma1_cntr4")));
volatile uint32_t DMA1_PADDR4 __attribute__((section(".dma1_paddr4")));
volatile uint32_t DMA1_MADDR4 __attribute__((section(".dma1_maddr4")));
volatile dma1_cfgr5_t DMA1_CFGR5 __attribute__((section(".dma1_cfgr5")));
volatile dma1_cntr5_t DMA1_CNTR5 __attribute__((section(".dma1_cntr5")));
volatile uint32_t DMA1_PADDR5 __attribute__((section(".dma1_paddr5")));
volatile uint32_t DMA1_MADDR5 __attribute__((section(".dma1_maddr5")));
volatile dma1_cfgr6_t DMA1_CFGR6 __attribute__((section(".dma1_cfgr6")));
volatile dma1_cntr6_t DMA1_CNTR6 __attribute__((section(".dma1_cntr6")));
volatile uint32_t DMA1_PADDR6 __attribute__((section(".dma1_paddr6")));
volatile uint32_t DMA1_MADDR6 __attribute__((section(".dma1_maddr6")));
volatile dma1_cfgr7_t DMA1_CFGR7 __attribute__((section(".dma1_cfgr7")));
volatile dma1_cntr7_t DMA1_CNTR7 __attribute__((section(".dma1_cntr7")));
volatile uint32_t DMA1_PADDR7 __attribute__((section(".dma1_paddr7")));
volatile uint32_t DMA1_MADDR7 __attribute__((section(".dma1_maddr7")));
volatile iwdg_ctlr_t IWDG_CTLR __attribute__((section(".iwdg_ctlr")));
volatile iwdg_pscr_t IWDG_PSCR __attribute__((section(".iwdg_pscr")));
volatile iwdg_rldr_t IWDG_RLDR __attribute__((section(".iwdg_rldr")));
volatile iwdg_statr_t IWDG_STATR __attribute__((section(".iwdg_statr")));
volatile wwdg_ctlr_t WWDG_CTLR __attribute__((section(".wwdg_ctlr")));
volatile wwdg_cfgr_t WWDG_CFGR __attribute__((section(".wwdg_cfgr")));
volatile wwdg_statr_t WWDG_STATR __attribute__((section(".wwdg_statr")));
volatile tim1_ctlr1_t TIM1_CTLR1 __attribute__((section(".tim1_ctlr1")));
volatile tim1_ctlr2_t TIM1_CTLR2 __attribute__((section(".tim1_ctlr2")));
volatile tim1_smcfgr_t TIM1_SMCFGR __attribute__((section(".tim1_smcfgr")));
volatile tim1_dmaintenr_t TIM1_DMAINTENR __attribute__((section(".tim1_dmaintenr")));
volatile tim1_intfr_t TIM1_INTFR __attribute__((section(".tim1_intfr")));
volatile tim1_swevgr_t TIM1_SWEVGR __attribute__((section(".tim1_swevgr")));
volatile tim1_chctlr1_t TIM1_CHCTLR1 __attribute__((section(".tim1_chctlr1")));
volatile tim1_chctlr2_t TIM1_CHCTLR2 __attribute__((section(".tim1_chctlr2")));
volatile tim1_ccer_t TIM1_CCER __attribute__((section(".tim1_ccer")));
volatile tim1_cnt_t TIM1_CNT __attribute__((section(".tim1_cnt")));
volatile tim1_psc_t TIM1_PSC __attribute__((section(".tim1_psc")));
volatile tim1_atrlr_t TIM1_ATRLR __attribute__((section(".tim1_atrlr")));
volatile tim1_rptcr_t TIM1_RPTCR __attribute__((section(".tim1_rptcr")));
volatile tim1_ch1cvr_t TIM1_CH1CVR __attribute__((section(".tim1_ch1cvr")));
volatile tim1_ch2cvr_t TIM1_CH2CVR __attribute__((section(".tim1_ch2cvr")));
volatile tim1_ch3cvr_t TIM1_CH3CVR __attribute__((section(".tim1_ch3cvr")));
volatile tim1_ch4cvr_t TIM1_CH4CVR __attribute__((section(".tim1_ch4cvr")));
volatile tim1_bdtr_t TIM1_BDTR __attribute__((section(".tim1_bdtr")));
volatile tim1_dmacfgr_t TIM1_DMACFGR __attribute__((section(".tim1_dmacfgr")));
volatile tim1_dmaadr_t TIM1_DMAADR __attribute__((section(".tim1_dmaadr")));
volatile tim2_ctlr1_t TIM2_CTLR1 __attribute__((section(".tim2_ctlr1")));
volatile tim2_ctlr2_t TIM2_CTLR2 __attribute__((section(".tim2_ctlr2")));
volatile tim2_smcfgr_t TIM2_SMCFGR __attribute__((section(".tim2_smcfgr")));
volatile tim2_dmaintenr_t TIM2_DMAINTENR __attribute__((section(".tim2_dmaintenr")));
volatile tim2_intfr_t TIM2_INTFR __attribute__((section(".tim2_intfr")));
volatile tim2_swevgr_t TIM2_SWEVGR __attribute__((section(".tim2_swevgr")));
volatile tim2_chctlr1_t TIM2_CHCTLR1 __attribute__((section(".tim2_chctlr1")));
volatile tim2_chctlr2_t TIM2_CHCTLR2 __attribute__((section(".tim2_chctlr2")));
volatile tim2_ccer_t TIM2_CCER __attribute__((section(".tim2_ccer")));
volatile tim2_cnt_t TIM2_CNT __attribute__((section(".tim2_cnt")));
volatile tim2_psc_t TIM2_PSC __attribute__((section(".tim2_psc")));
volatile tim2_atrlr_t TIM2_ATRLR __attribute__((section(".tim2_atrlr")));
volatile tim2_ch1cvr_t TIM2_CH1CVR __attribute__((section(".tim2_ch1cvr")));
volatile tim2_ch2cvr_t TIM2_CH2CVR __attribute__((section(".tim2_ch2cvr")));
volatile tim2_ch3cvr_t TIM2_CH3CVR __attribute__((section(".tim2_ch3cvr")));
volatile tim2_ch4cvr_t TIM2_CH4CVR __attribute__((section(".tim2_ch4cvr")));
volatile tim2_dmacfgr_t TIM2_DMACFGR __attribute__((section(".tim2_dmacfgr")));
volatile tim2_dmaadr_t TIM2_DMAADR __attribute__((section(".tim2_dmaadr")));
volatile i2c1_ctlr1_t I2C1_CTLR1 __attribute__((section(".i2c1_ctlr1")));
volatile i2c1_ctlr2_t I2C1_CTLR2 __attribute__((section(".i2c1_ctlr2")));
volatile i2c1_oaddr1_t I2C1_OADDR1 __attribute__((section(".i2c1_oaddr1")));
volatile i2c1_oaddr2_t I2C1_OADDR2 __attribute__((section(".i2c1_oaddr2")));
volatile i2c1_datar_t I2C1_DATAR __attribute__((section(".i2c1_datar")));
volatile i2c1_star1_t I2C1_STAR1 __attribute__((section(".i2c1_star1")));
volatile i2c1_star2_t I2C1_STAR2 __attribute__((section(".i2c1_star2")));
volatile i2c1_ckcfgr_t I2C1_CKCFGR __attribute__((section(".i2c1_ckcfgr")));
volatile spi1_ctlr1_t SPI1_CTLR1 __attribute__((section(".spi1_ctlr1")));
volatile spi1_ctlr2_t SPI1_CTLR2 __attribute__((section(".spi1_ctlr2")));
volatile spi1_statr_t SPI1_STATR __attribute__((section(".spi1_statr")));
volatile spi1_datar_t SPI1_DATAR __attribute__((section(".spi1_datar")));
volatile spi1_crcr_t SPI1_CRCR __attribute__((section(".spi1_crcr")));
volatile spi1_rcrcr_t SPI1_RCRCR __attribute__((section(".spi1_rcrcr")));
volatile spi1_tcrcr_t SPI1_TCRCR __attribute__((section(".spi1_tcrcr")));
volatile spi1_hscr_t SPI1_HSCR __attribute__((section(".spi1_hscr")));
volatile usart1_statr_t USART1_STATR __attribute__((section(".usart1_statr")));
volatile usart1_datar_t USART1_DATAR __attribute__((section(".usart1_datar")));
volatile usart1_brr_t USART1_BRR __attribute__((section(".usart1_brr")));
volatile usart1_ctlr1_t USART1_CTLR1 __attribute__((section(".usart1_ctlr1")));
volatile usart1_ctlr2_t USART1_CTLR2 __attribute__((section(".usart1_ctlr2")));
volatile usart1_ctlr3_t USART1_CTLR3 __attribute__((section(".usart1_ctlr3")));
volatile usart1_gpr_t USART1_GPR __attribute__((section(".usart1_gpr")));
volatile adc1_statr_t ADC1_STATR __attribute__((section(".adc1_statr")));
volatile adc1_ctlr1_t ADC1_CTLR1 __attribute__((section(".adc1_ctlr1")));
volatile adc1_ctlr2_t ADC1_CTLR2 __attribute__((section(".adc1_ctlr2")));
volatile adc1_samptr1_charge1_t ADC1_SAMPTR1_CHARGE1 __attribute__((section(".adc1_samptr1_charge1")));
volatile adc1_samptr2_charge2_t ADC1_SAMPTR2_CHARGE2 __attribute__((section(".adc1_samptr2_charge2")));
volatile adc1_iofr1_t ADC1_IOFR1 __attribute__((section(".adc1_iofr1")));
volatile adc1_iofr2_t ADC1_IOFR2 __attribute__((section(".adc1_iofr2")));
volatile adc1_iofr3_t ADC1_IOFR3 __attribute__((section(".adc1_iofr3")));
volatile adc1_iofr4_t ADC1_IOFR4 __attribute__((section(".adc1_iofr4")));
volatile adc1_wdhtr_t ADC1_WDHTR __attribute__((section(".adc1_wdhtr")));
volatile adc1_wdltr_t ADC1_WDLTR __attribute__((section(".adc1_wdltr")));
volatile adc1_rsqr1_t ADC1_RSQR1 __attribute__((section(".adc1_rsqr1")));
volatile adc1_rsqr2_t ADC1_RSQR2 __attribute__((section(".adc1_rsqr2")));
volatile adc1_rsqr3_t ADC1_RSQR3 __attribute__((section(".adc1_rsqr3")));
volatile adc1_isqr_t ADC1_ISQR __attribute__((section(".adc1_isqr")));
volatile adc1_idatar1_t ADC1_IDATAR1 __attribute__((section(".adc1_idatar1")));
volatile adc1_idatar2_t ADC1_IDATAR2 __attribute__((section(".adc1_idatar2")));
volatile adc1_idatar3_t ADC1_IDATAR3 __attribute__((section(".adc1_idatar3")));
volatile adc1_idatar4_t ADC1_IDATAR4 __attribute__((section(".adc1_idatar4")));
volatile uint32_t ADC1_RDATAR __attribute__((section(".adc1_rdatar")));
volatile adc1_dlyr_t ADC1_DLYR __attribute__((section(".adc1_dlyr")));
volatile dbg_cfgr1_t DBG_CFGR1 __attribute__((section(".dbg_cfgr1")));
volatile dbg_cfgr2_t DBG_CFGR2 __attribute__((section(".dbg_cfgr2")));
volatile uint16_t ESIG_FLACAP __attribute__((section(".esig_flacap")));
volatile uint32_t ESIG_UNIID1 __attribute__((section(".esig_uniid1")));
volatile uint32_t ESIG_UNIID2 __attribute__((section(".esig_uniid2")));
volatile uint32_t ESIG_UNIID3 __attribute__((section(".esig_uniid3")));
volatile flash_actlr_t FLASH_ACTLR __attribute__((section(".flash_actlr")));
volatile uint32_t FLASH_KEYR __attribute__((section(".flash_keyr")));
volatile uint32_t FLASH_OBKEYR __attribute__((section(".flash_obkeyr")));
volatile flash_statr_t FLASH_STATR __attribute__((section(".flash_statr")));
volatile flash_ctlr_t FLASH_CTLR __attribute__((section(".flash_ctlr")));
volatile uint32_t FLASH_ADDR __attribute__((section(".flash_addr")));
volatile flash_obr_t FLASH_OBR __attribute__((section(".flash_obr")));
volatile uint32_t FLASH_WPR __attribute__((section(".flash_wpr")));
volatile uint32_t FLASH_MODEKEYR __attribute__((section(".flash_modekeyr")));
volatile uint32_t FLASH_BOOT_MODEKEYP __attribute__((section(".flash_boot_modekeyp")));
volatile pfic_isr1_t PFIC_ISR1 __attribute__((section(".pfic_isr1")));
volatile uint32_t PFIC_ISR2 __attribute__((section(".pfic_isr2")));
volatile uint32_t PFIC_ISR3 __attribute__((section(".pfic_isr3")));
volatile pfic_isr4_t PFIC_ISR4 __attribute__((section(".pfic_isr4")));
volatile pfic_ipr1_t PFIC_IPR1 __attribute__((section(".pfic_ipr1")));
volatile uint32_t PFIC_IPR2 __attribute__((section(".pfic_ipr2")));
volatile uint32_t PFIC_IPR3 __attribute__((section(".pfic_ipr3")));
volatile pfic_ipr4_t PFIC_IPR4 __attribute__((section(".pfic_ipr4")));
volatile pfic_ithresdr_t PFIC_ITHRESDR __attribute__((section(".pfic_ithresdr")));
volatile pfic_cfgr_t PFIC_CFGR __attribute__((section(".pfic_cfgr")));
volatile pfic_gisr_t PFIC_GISR __attribute__((section(".pfic_gisr")));
volatile pfic_vtfidr_t PFIC_VTFIDR __attribute__((section(".pfic_vtfidr")));
volatile pfic_vtfaddrr0_t PFIC_VTFADDRR0 __attribute__((section(".pfic_vtfaddrr0")));
volatile pfic_vtfaddrr1_t PFIC_VTFADDRR1 __attribute__((section(".pfic_vtfaddrr1")));
volatile pfic_vtfaddrr2_t PFIC_VTFADDRR2 __attribute__((section(".pfic_vtfaddrr2")));
volatile pfic_vtfaddrr3_t PFIC_VTFADDRR3 __attribute__((section(".pfic_vtfaddrr3")));
volatile pfic_ienr1_t PFIC_IENR1 __attribute__((section(".pfic_ienr1")));
volatile uint32_t PFIC_IENR2 __attribute__((section(".pfic_ienr2")));
volatile uint32_t PFIC_IENR3 __attribute__((section(".pfic_ienr3")));
volatile pfic_ienr4_t PFIC_IENR4 __attribute__((section(".pfic_ienr4")));
volatile pfic_irer1_t PFIC_IRER1 __attribute__((section(".pfic_irer1")));
volatile uint32_t PFIC_IRER2 __attribute__((section(".pfic_irer2")));
volatile uint32_t PFIC_IRER3 __attribute__((section(".pfic_irer3")));
volatile pfic_irer4_t PFIC_IRER4 __attribute__((section(".pfic_irer4")));
volatile pfic_ipsr1_t PFIC_IPSR1 __attribute__((section(".pfic_ipsr1")));
volatile uint32_t PFIC_IPSR2 __attribute__((section(".pfic_ipsr2")));
volatile uint32_t PFIC_IPSR3 __attribute__((section(".pfic_ipsr3")));
volatile pfic_ipsr4_t PFIC_IPSR4 __attribute__((section(".pfic_ipsr4")));
volatile pfic_iprr1_t PFIC_IPRR1 __attribute__((section(".pfic_iprr1")));
volatile uint32_t PFIC_IPRR2 __attribute__((section(".pfic_iprr2")));
volatile uint32_t PFIC_IPRR3 __attribute__((section(".pfic_iprr3")));
volatile pfic_iprr4_t PFIC_IPRR4 __attribute__((section(".pfic_iprr4")));
volatile pfic_iactr1_t PFIC_IACTR1 __attribute__((section(".pfic_iactr1")));
volatile uint32_t PFIC_IACTR2 __attribute__((section(".pfic_iactr2")));
volatile uint32_t PFIC_IACTR3 __attribute__((section(".pfic_iactr3")));
volatile pfic_iactr4_t PFIC_IACTR4 __attribute__((section(".pfic_iactr4")));
volatile uint8_t PFIC_IPRIOR0 __attribute__((section(".pfic_iprior0")));
volatile uint8_t PFIC_IPRIOR1 __attribute__((section(".pfic_iprior1")));
volatile uint8_t PFIC_IPRIOR2 __attribute__((section(".pfic_iprior2")));
volatile uint8_t PFIC_IPRIOR3 __attribute__((section(".pfic_iprior3")));
volatile uint8_t PFIC_IPRIOR4 __attribute__((section(".pfic_iprior4")));
volatile uint8_t PFIC_IPRIOR5 __attribute__((section(".pfic_iprior5")));
volatile uint8_t PFIC_IPRIOR6 __attribute__((section(".pfic_iprior6")));
volatile uint8_t PFIC_IPRIOR7 __attribute__((section(".pfic_iprior7")));
volatile uint8_t PFIC_IPRIOR8 __attribute__((section(".pfic_iprior8")));
volatile uint8_t PFIC_IPRIOR9 __attribute__((section(".pfic_iprior9")));
volatile uint8_t PFIC_IPRIOR10 __attribute__((section(".pfic_iprior10")));
volatile uint8_t PFIC_IPRIOR11 __attribute__((section(".pfic_iprior11")));
volatile uint8_t PFIC_IPRIOR12 __attribute__((section(".pfic_iprior12")));
volatile uint8_t PFIC_IPRIOR13 __attribute__((section(".pfic_iprior13")));
volatile uint8_t PFIC_IPRIOR14 __attribute__((section(".pfic_iprior14")));
volatile uint8_t PFIC_IPRIOR15 __attribute__((section(".pfic_iprior15")));
volatile uint8_t PFIC_IPRIOR16 __attribute__((section(".pfic_iprior16")));
volatile uint8_t PFIC_IPRIOR17 __attribute__((section(".pfic_iprior17")));
volatile uint8_t PFIC_IPRIOR18 __attribute__((section(".pfic_iprior18")));
volatile uint8_t PFIC_IPRIOR19 __attribute__((section(".pfic_iprior19")));
volatile uint8_t PFIC_IPRIOR20 __attribute__((section(".pfic_iprior20")));
volatile uint8_t PFIC_IPRIOR21 __attribute__((section(".pfic_iprior21")));
volatile uint8_t PFIC_IPRIOR22 __attribute__((section(".pfic_iprior22")));
volatile uint8_t PFIC_IPRIOR23 __attribute__((section(".pfic_iprior23")));
volatile uint8_t PFIC_IPRIOR24 __attribute__((section(".pfic_iprior24")));
volatile uint8_t PFIC_IPRIOR25 __attribute__((section(".pfic_iprior25")));
volatile uint8_t PFIC_IPRIOR26 __attribute__((section(".pfic_iprior26")));
volatile uint8_t PFIC_IPRIOR27 __attribute__((section(".pfic_iprior27")));
volatile uint8_t PFIC_IPRIOR28 __attribute__((section(".pfic_iprior28")));
volatile uint8_t PFIC_IPRIOR29 __attribute__((section(".pfic_iprior29")));
volatile uint8_t PFIC_IPRIOR30 __attribute__((section(".pfic_iprior30")));
volatile uint8_t PFIC_IPRIOR31 __attribute__((section(".pfic_iprior31")));
volatile uint8_t PFIC_IPRIOR32 __attribute__((section(".pfic_iprior32")));
volatile uint8_t PFIC_IPRIOR33 __attribute__((section(".pfic_iprior33")));
volatile uint8_t PFIC_IPRIOR34 __attribute__((section(".pfic_iprior34")));
volatile uint8_t PFIC_IPRIOR35 __attribute__((section(".pfic_iprior35")));
volatile uint8_t PFIC_IPRIOR36 __attribute__((section(".pfic_iprior36")));
volatile uint8_t PFIC_IPRIOR37 __attribute__((section(".pfic_iprior37")));
volatile uint8_t PFIC_IPRIOR38 __attribute__((section(".pfic_iprior38")));
volatile uint8_t PFIC_IPRIOR39 __attribute__((section(".pfic_iprior39")));
volatile uint8_t PFIC_IPRIOR40 __attribute__((section(".pfic_iprior40")));
volatile uint8_t PFIC_IPRIOR41 __attribute__((section(".pfic_iprior41")));
volatile uint8_t PFIC_IPRIOR42 __attribute__((section(".pfic_iprior42")));
volatile uint8_t PFIC_IPRIOR43 __attribute__((section(".pfic_iprior43")));
volatile uint8_t PFIC_IPRIOR44 __attribute__((section(".pfic_iprior44")));
volatile uint8_t PFIC_IPRIOR45 __attribute__((section(".pfic_iprior45")));
volatile uint8_t PFIC_IPRIOR46 __attribute__((section(".pfic_iprior46")));
volatile uint8_t PFIC_IPRIOR47 __attribute__((section(".pfic_iprior47")));
volatile uint8_t PFIC_IPRIOR48 __attribute__((section(".pfic_iprior48")));
volatile uint8_t PFIC_IPRIOR49 __attribute__((section(".pfic_iprior49")));
volatile uint8_t PFIC_IPRIOR50 __attribute__((section(".pfic_iprior50")));
volatile uint8_t PFIC_IPRIOR51 __attribute__((section(".pfic_iprior51")));
volatile uint8_t PFIC_IPRIOR52 __attribute__((section(".pfic_iprior52")));
volatile uint8_t PFIC_IPRIOR53 __attribute__((section(".pfic_iprior53")));
volatile uint8_t PFIC_IPRIOR54 __attribute__((section(".pfic_iprior54")));
volatile uint8_t PFIC_IPRIOR55 __attribute__((section(".pfic_iprior55")));
volatile uint8_t PFIC_IPRIOR56 __attribute__((section(".pfic_iprior56")));
volatile uint8_t PFIC_IPRIOR57 __attribute__((section(".pfic_iprior57")));
volatile uint8_t PFIC_IPRIOR58 __attribute__((section(".pfic_iprior58")));
volatile uint8_t PFIC_IPRIOR59 __attribute__((section(".pfic_iprior59")));
volatile uint8_t PFIC_IPRIOR60 __attribute__((section(".pfic_iprior60")));
volatile uint8_t PFIC_IPRIOR61 __attribute__((section(".pfic_iprior61")));
volatile uint8_t PFIC_IPRIOR62 __attribute__((section(".pfic_iprior62")));
volatile uint8_t PFIC_IPRIOR63 __attribute__((section(".pfic_iprior63")));
volatile pfic_sctlr_t PFIC_SCTLR __attribute__((section(".pfic_sctlr")));
volatile pfic_stk_ctlr_t PFIC_STK_CTLR __attribute__((section(".pfic_stk_ctlr")));
volatile pfic_stk_sr_t PFIC_STK_SR __attribute__((section(".pfic_stk_sr")));
volatile uint32_t PFIC_STK_CNTL __attribute__((section(".pfic_stk_cntl")));
volatile uint32_t PFIC_STK_CMPLR __attribute__((section(".pfic_stk_cmplr")));
